app/controllers/api/clips_controller.rb

SELECT "clips".* FROM "clips"
---
    def index
        @clips = Clip.all

INSERT INTO "clips" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "DotaWTF"], ["user_id", 1], ["created_at", "2021-03-19 22:46:06.549499"], ["updated_at", "2021-03-19 22:46:06.549499"]]
---
    def create
        # pusher = Pusher::Client.new(
        #     app_id: '1174180',
        #     key: '4efa8992028154c12bf1',
        #     secret: '549f1209e1dc27c33bb5',
        #     cluster: 'us3'
        # )
        # pusher.trigger('my-channel-will', 'my-event-will', {:message => 'YOOYOYYOOYOYOYO@@@@@@@@@@@@@@@@@@@@'})
        clip = Clip.new(clip_params)
        if clip.save

SELECT  "clips".* FROM "clips" WHERE "clips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @clip = Clip.find(params[:id])