app/controllers/api/clips_controller.rb

    def show
        @clip = Clip.find(params[:id])
---
SELECT  "clips".* FROM "clips" WHERE "clips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]